barryblueice/ESP32-Precision-TouchPad/main/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0xd00
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x72a
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="R-SODIUM Technology"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="R-SODIUM Precision TouchPad"
CONFIG_TINYUSB_DESC_SERIAL_STRING="0D00072A00000000"
CONFIG_TINYUSB_HID_COUNT=2
